
### :robot: Terraform Report
---
##### Plan: `38` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.base.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "iacp1-rg"
      + tags     = {
          + "siteId" = "iacp1"
        }
    }

  # module.base.module.hci0.data.azapi_resource.arcSettings will be read during apply
  # (config refers to values not yet known)
 <= data "azapi_resource" "arcSettings" {
      + id          = (known after apply)
      + identity    = (known after apply)
      + location    = (known after apply)
      + name        = "default"
      + output      = (known after apply)
      + parent_id   = (known after apply)
      + resource_id = (known after apply)
      + tags        = (known after apply)
      + type        = "Microsoft.AzureStackHCI/clusters/ArcSettings@2023-08-01"
    }

  # module.base.module.hci0.data.azapi_resource.arcbridge will be read during apply
  # (config refers to values not yet known)
 <= data "azapi_resource" "arcbridge" {
      + id          = (known after apply)
      + identity    = (known after apply)
      + location    = (known after apply)
      + name        = "iacp1-cl-arcbridge"
      + output      = (known after apply)
      + parent_id   = (known after apply)
      + resource_id = (known after apply)
      + tags        = (known after apply)
      + type        = "Microsoft.ResourceConnector/appliances@2022-10-27"
    }

  # module.base.module.hci0.data.azapi_resource.customlocation will be read during apply
  # (config refers to values not yet known)
 <= data "azapi_resource" "customlocation" {
      + id          = (known after apply)
      + identity    = (known after apply)
      + location    = (known after apply)
      + name        = "iacp1-customlocation"
      + output      = (known after apply)
      + parent_id   = (known after apply)
      + resource_id = (known after apply)
      + tags        = (known after apply)
      + type        = "Microsoft.ExtendedLocation/customLocations@2021-08-15"
    }

  # module.base.module.hci0.data.azapi_resource_list.userStorages will be read during apply
  # (config refers to values not yet known)
 <= data "azapi_resource_list" "userStorages" {
      + id                     = (known after apply)
      + output                 = (known after apply)
      + parent_id              = (known after apply)
      + response_export_values = [
          + "*",
        ]
      + type                   = "Microsoft.AzureStackHCI/storagecontainers@2022-12-15-preview"
    }

  # module.base.module.hci0.data.azurerm_arc_machine.arcservers["AzSHOST1"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_arc_machine" "arcservers" {
      + active_directory_fqdn          = (known after apply)
      + agent                          = (known after apply)
      + agent_version                  = (known after apply)
      + client_public_key              = (known after apply)
      + cloud_metadata                 = (known after apply)
      + detected_properties            = (known after apply)
      + display_name                   = (known after apply)
      + dns_fqdn                       = (known after apply)
      + domain_name                    = (known after apply)
      + id                             = (known after apply)
      + identity                       = (known after apply)
      + last_status_change_time        = (known after apply)
      + location                       = (known after apply)
      + location_data                  = (known after apply)
      + machine_fqdn                   = (known after apply)
      + mssql_discovered               = (known after apply)
      + name                           = "AzSHOST1"
      + os_name                        = (known after apply)
      + os_profile                     = (known after apply)
      + os_sku                         = (known after apply)
      + os_type                        = (known after apply)
      + os_version                     = (known after apply)
      + parent_cluster_resource_id     = (known after apply)
      + private_link_scope_resource_id = (known after apply)
      + resource_group_name            = "iacp1-rg"
      + service_status                 = (known after apply)
      + status                         = (known after apply)
      + tags                           = (known after apply)
      + vm_id                          = (known after apply)
      + vm_uuid                        = (known after apply)
    }

  # module.base.module.hci0.data.azurerm_arc_machine.arcservers["AzSHOST2"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_arc_machine" "arcservers" {
      + active_directory_fqdn          = (known after apply)
      + agent                          = (known after apply)
      + agent_version                  = (known after apply)
      + client_public_key              = (known after apply)
      + cloud_metadata                 = (known after apply)
      + detected_properties            = (known after apply)
      + display_name                   = (known after apply)
      + dns_fqdn                       = (known after apply)
      + domain_name                    = (known after apply)
      + id                             = (known after apply)
      + identity                       = (known after apply)
      + last_status_change_time        = (known after apply)
      + location                       = (known after apply)
      + location_data                  = (known after apply)
      + machine_fqdn                   = (known after apply)
      + mssql_discovered               = (known after apply)
      + name                           = "AzSHOST2"
      + os_name                        = (known after apply)
      + os_profile                     = (known after apply)
      + os_sku                         = (known after apply)
      + os_type                        = (known after apply)
      + os_version                     = (known after apply)
      + parent_cluster_resource_id     = (known after apply)
      + private_link_scope_resource_id = (known after apply)
      + resource_group_name            = "iacp1-rg"
      + service_status                 = (known after apply)
      + status                         = (known after apply)
      + tags                           = (known after apply)
      + vm_id                          = (known after apply)
      + vm_uuid                        = (known after apply)
    }

  # module.base.module.hci0.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.base.module.hci0.azapi_resource.cluster will be created
  + resource "azapi_resource" "cluster" {
      + body                      = {
          + properties = {}
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus"
      + name                      = "iacp1-cl"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + type                      = "Microsoft.AzureStackHCI/clusters@2023-08-01-preview"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.base.module.hci0.azapi_resource.validatedeploymentsetting_seperate[0] will be created
  + resource "azapi_resource" "validatedeploymentsetting_seperate" {
      + body                      = {
          + properties = {
              + arcNodeResourceIds      = [
                  + (known after apply),
                  + (known after apply),
                ]
              + deploymentConfiguration = {
                  + scaleUnits = [
                      + {
                          + deploymentData = {
                              + adouPath              = "OU=iacp1,DC=jumpstart,DC=local"
                              + cluster               = {
                                  + azureServiceEndpoint = "core.windows.net"
                                  + cloudAccountName     = (known after apply)
                                  + name                 = "iacp1-cl"
                                  + witnessPath          = "Cloud"
                                  + witnessType          = "Cloud"
                                }
                              + domainFqdn            = "jumpstart.local"
                              + hostNetwork           = {
                                  + enableStorageAutoIp           = true
                                  + intents                       = [
                                      + {
                                          + adapter                             = [
                                              + "FABRIC",
                                              + "FABRIC2",
                                            ]
                                          + adapterPropertyOverrides            = {
                                              + jumboPacket             = ""
                                              + networkDirect           = "Disabled"
                                              + networkDirectTechnology = ""
                                            }
                                          + name                                = "ManagementCompute"
                                          + overrideAdapterProperty             = true
                                          + overrideQosPolicy                   = false
                                          + overrideVirtualSwitchConfiguration  = false
                                          + qosPolicyOverrides                  = {
                                              + bandwidthPercentage_SMB         = ""
                                              + priorityValue8021Action_Cluster = ""
                                              + priorityValue8021Action_SMB     = ""
                                            }
                                          + trafficType                         = [
                                              + "Management",
                                              + "Compute",
                                            ]
                                          + virtualSwitchConfigurationOverrides = {
                                              + enableIov              = ""
                                              + loadBalancingAlgorithm = ""
                                            }
                                        },
                                      + {
                                          + adapter                             = [
                                              + "StorageA",
                                              + "StorageB",
                                            ]
                                          + adapterPropertyOverrides            = {
                                              + jumboPacket             = ""
                                              + networkDirect           = "Disabled"
                                              + networkDirectTechnology = ""
                                            }
                                          + name                                = "Storage"
                                          + overrideAdapterProperty             = true
                                          + overrideQosPolicy                   = false
                                          + overrideVirtualSwitchConfiguration  = false
                                          + qosPolicyOverrides                  = {
                                              + bandwidthPercentage_SMB         = ""
                                              + priorityValue8021Action_Cluster = ""
                                              + priorityValue8021Action_SMB     = ""
                                            }
                                          + trafficType                         = [
                                              + "Storage",
                                            ]
                                          + virtualSwitchConfigurationOverrides = {
                                              + enableIov              = ""
                                              + loadBalancingAlgorithm = ""
                                            }
                                        },
                                    ]
                                  + storageConnectivitySwitchless = false
                                  + storageNetworks               = [
                                      + {
                                          + name               = "Storage1Network"
                                          + networkAdapterName = "StorageA"
                                          + vlanId             = "711"
                                        },
                                      + {
                                          + name               = "Storage2Network"
                                          + networkAdapterName = "StorageB"
                                          + vlanId             = "712"
                                        },
                                    ]
                                }
                              + infrastructureNetwork = [
                                  + {
                                      + dnsServers = [
                                          + "192.168.1.254",
                                        ]
                                      + gateway    = "192.168.1.1"
                                      + ipPools    = [
                                          + {
                                              + endingAddress   = "192.168.1.65"
                                              + startingAddress = "192.168.1.55"
                                            },
                                        ]
                                      + subnetMask = "255.255.255.0"
                                      + useDhcp    = false
                                    },
                                ]
                              + namingPrefix          = "iacp1"
                              + observability         = {
                                  + episodicDataUpload  = true
                                  + euLocation          = false
                                  + streamingDataClient = true
                                }
                              + optionalServices      = {
                                  + customLocation = "iacp1-customlocation"
                                }
                              + physicalNodes         = [
                                  + {
                                      + ipv4Address = "192.168.1.12"
                                      + name        = "AzSHOST1"
                                    },
                                  + {
                                      + ipv4Address = "192.168.1.13"
                                      + name        = "AzSHOST2"
                                    },
                                ]
                              + secretsLocation       = (known after apply)
                              + securitySettings      = {
                                  + bitlockerBootVolume           = true
                                  + bitlockerDataVolumes          = true
                                  + credentialGuardEnforced       = true
                                  + driftControlEnforced          = true
                                  + drtmProtection                = true
                                  + hvciProtection                = true
                                  + sideChannelMitigationEnforced = true
                                  + smbClusterEncryption          = false
                                  + smbSigningEnforced            = true
                                  + wdacEnforced                  = true
                                }
                              + storage               = {
                                  + configurationMode = "Express"
                                }
                            }
                        },
                    ]
                  + version    = "10.0.0.0"
                }
              + deploymentMode          = "Validate"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "default"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.AzureStackHCI/clusters/deploymentSettings@2023-08-01-preview"
    }

  # module.base.module.hci0.azapi_update_resource.deploymentsetting[0] will be created
  + resource "azapi_update_resource" "deploymentsetting" {
      + body                    = {
          + properties = {
              + deploymentMode = "Deploy"
            }
        }
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "default"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.AzureStackHCI/clusters/deploymentSettings@2023-08-01-preview"

      + timeouts {
          + create = "24h"
          + delete = "60m"
        }
    }

  # module.base.module.hci0.azurerm_key_vault.DeploymentKeyVault will be created
  + resource "azurerm_key_vault" "DeploymentKeyVault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = true
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "eastus"
      + name                            = (known after apply)
      + public_network_access_enabled   = true
      + resource_group_name             = "iacp1-rg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 30
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # module.base.module.hci0.azurerm_key_vault_secret.AzureStackLCMUserCredential will be created
  + resource "azurerm_key_vault_secret" "AzureStackLCMUserCredential" {
      + content_type            = "Secret"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "AzureStackLCMUserCredential"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.base.module.hci0.azurerm_key_vault_secret.DefaultARBApplication will be created
  + resource "azurerm_key_vault_secret" "DefaultARBApplication" {
      + content_type            = "Secret"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "DefaultARBApplication"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.base.module.hci0.azurerm_key_vault_secret.LocalAdminCredential will be created
  + resource "azurerm_key_vault_secret" "LocalAdminCredential" {
      + content_type            = "Secret"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "LocalAdminCredential"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.base.module.hci0.azurerm_key_vault_secret.WitnessStorageKey will be created
  + resource "azurerm_key_vault_secret" "WitnessStorageKey" {
      + content_type            = "Secret"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "WitnessStorageKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.base.module.hci0.azurerm_role_assignment.ServicePrincipalRoleAssign["ACMRM"] will be created
  + resource "azurerm_role_assignment" "ServicePrincipalRoleAssign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f0e0e122-3f80-44ed-95d2-f56e6fdc514c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Connected Machine Resource Manager"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci0.azurerm_storage_account.witness will be created
  + resource "azurerm_storage_account" "witness" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = (known after apply)
      + https_traffic_only_enabled         = (known after apply)
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "iacp1-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)
    }

  # module.base.module.hci0.random_integer.random_suffix will be created
  + resource "random_integer" "random_suffix" {
      + id     = (known after apply)
      + max    = 99
      + min    = 10
      + result = (known after apply)
    }

  # module.base.module.hci0-aksarc0.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.base.module.hci0-aksarc0.azapi_resource.connectedCluster will be created
  + resource "azapi_resource" "connectedCluster" {
      + body                      = {
          + kind       = "ProvisionedCluster"
          + properties = {
              + aadProfile                = {
                  + adminGroupObjectIDs = [
                      + "ed888f99-66c1-48fe-992f-030f49ba50ed",
                    ]
                  + enableAzureRBAC     = true
                  + tenantID            = (known after apply)
                }
              + agentPublicKeyCertificate = ""
              + azureHybridBenefit        = null
              + distribution              = null
              + infrastructure            = null
              + privateLinkState          = null
              + provisioningState         = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus"
      + name                      = "iacp1-aksArc"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.Kubernetes/connectedClusters@2024-01-01"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.base.module.hci0-aksarc0.azapi_resource.provisionedClusterInstance will be created
  + resource "azapi_resource" "provisionedClusterInstance" {
      + body                      = {
          + extendedLocation = {
              + name = (known after apply)
              + type = "CustomLocation"
            }
          + properties       = {
              + agentPoolProfiles      = [
                  + {
                      + count  = 1
                      + name   = "nodepool1"
                      + osSKU  = "CBLMariner"
                      + osType = "Linux"
                      + vmSize = "Standard_A4_v2"
                    },
                ]
              + cloudProviderProfile   = {
                  + infraNetworkProfile = {
                      + vnetSubnetIds = [
                          + (known after apply),
                        ]
                    }
                }
              + clusterVMAccessProfile = {}
              + controlPlane           = {
                  + controlPlaneEndpoint = {
                      + hostIP = "192.168.1.190"
                    }
                  + count                = 1
                  + vmSize               = "Standard_A4_v2"
                }
              + kubernetesVersion      = "1.28.5"
              + licenseProfile         = {
                  + azureHybridBenefit = "False"
                }
              + linuxProfile           = {
                  + ssh = {
                      + publicKeys = [
                          + {
                              + keyData = <<-EOT
                                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCy6RP4+djZ4dWQZeCID5fV/Wwlr0ax2snzGY31H9CbW5+Y5XmR3/C2a6kgBKVZGF3JMhmyQ6jq+pQw5GWRbhqhQ+WB4MH8/PJcSifaGbBGKjwLWXAHCQW0X7AuCUy2GaiYrHQyIaHvcSRILZzHhqmPXsL1OmG2Sn2RtqXKU/lZKxmCIADBMXpUPDffIR14FYCEzv5Lg33BO7xvTJ8SxnYoxvCAEJXwYqjkGIdC15UxhY9DgVcrA4Er/ZE98afEZNRT7L82oLenDKJXW4qMVjWge702MTiaMoRq3vSivxofCywYNIDS/obJda9etbGssn1I4fKlSzrmXvpD0nvM80UTlpS/CSvV7cou3V3hORFSK5cHt0eNFeUviIHiX6xQDmSlljmYJtjetytW9cqMspIEIvCq4DxlVat+4n/z4zk8m7ipt1Xf8dJ8AbDCJA9+rJgp7wH/XKU9V/SHSipRrEbYfHPKJCYVsaneT83o5wBJ/LX3lhLASEJNP4bowhjE69QjRIhdw4IkE5ldcvtVSn4ocOHu8WugQR4Bwalt3hnEFXSz/JBt735ge8ObBAbdZSuuRfixuEA7UYA9Prqg2a23LtuR5x3utEcfMQYtde7Qtk5k6wnM9qgJ2y1XID6hpLZ5JjHrqvH2bVVillcXeNIbWznX4bMUgugDdeMvxTPHsQ==
                                EOT
                            },
                        ]
                    }
                }
              + networkProfile         = {
                  + loadBalancerProfile = {}
                  + networkPolicy       = "calico"
                  + podCidr             = "10.244.0.0/16"
                }
              + storageProfile         = {
                  + nfsCsiDriver = {
                      + enabled = true
                    }
                  + smbCsiDriver = {
                      + enabled = true
                    }
                }
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "default"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.HybridContainerService/provisionedClusterInstances@2024-01-01"
    }

  # module.base.module.hci0-aksarc0.terraform_data.replacement[0] will be created
  + resource "terraform_data" "replacement" {
      + id     = (known after apply)
      + input  = "iacp1-rg"
      + output = (known after apply)
    }

  # module.base.module.hci0-aksarc0.terraform_data.waitAksVhdReady[0] will be created
  + resource "terraform_data" "waitAksVhdReady" {
      + id = (known after apply)
    }

  # module.base.module.hci0-extensions.azapi_resource.alerts[0] will be created
  + resource "azapi_resource" "alerts" {
      + body                      = {
          + properties = {
              + extensionParameters = {
                  + autoUpgradeMinorVersion = false
                  + enableAutomaticUpgrade  = true
                  + publisher               = "Microsoft.AzureStack.HCI.Alerts"
                  + settings                = {}
                  + type                    = "AlertsForWindowsHCI"
                }
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "AzureEdgeAlerts"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + type                      = "Microsoft.AzureStackHCI/clusters/ArcSettings/Extensions@2023-08-01"
    }

  # module.base.module.hci0-logical-network0.azapi_resource.logicalNetwork will be created
  + resource "azapi_resource" "logicalNetwork" {
      + body                      = {
          + extendedLocation = {
              + name = (known after apply)
              + type = "CustomLocation"
            }
          + properties       = {
              + dhcpOptions  = {
                  + dnsServers = [
                      + "192.168.1.254",
                    ]
                }
              + subnets      = [
                  + {
                      + name       = "default"
                      + properties = {
                          + addressPrefix      = "192.168.1.0/24"
                          + ipAllocationMethod = "Static"
                          + ipPools            = [
                              + {
                                  + end   = "192.168.1.190"
                                  + info  = {}
                                  + start = "192.168.1.171"
                                },
                            ]
                          + routeTable         = {
                              + properties = {
                                  + routes = [
                                      + {
                                          + name       = "default"
                                          + properties = {
                                              + addressPrefix    = "0.0.0.0/0"
                                              + nextHopIpAddress = "192.168.1.1"
                                            }
                                        },
                                    ]
                                }
                            }
                        }
                    },
                ]
              + vmSwitchName = "ConvergedSwitch(managementcompute)"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus"
      + name                      = "iacp1-logicalnetwork"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.AzureStackHCI/logicalNetworks@2023-09-01-preview"
    }

  # module.base.module.hci0-provisioners[0].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.base.module.hci0-provisioners[0].terraform_data.ad_creation_provisioner will be created
  + resource "terraform_data" "ad_creation_provisioner" {
      + id = (known after apply)
    }

  # module.base.module.hci0-provisioners[0].terraform_data.replacement will be created
  + resource "terraform_data" "replacement" {
      + id     = (known after apply)
      + input  = "iacp1-rg"
      + output = (known after apply)
    }

  # module.base.module.hci0.module.serverRoleBindings["AzSHOST1"].data.azurerm_arc_machine.server will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_arc_machine" "server" {
      + active_directory_fqdn          = (known after apply)
      + agent                          = (known after apply)
      + agent_version                  = (known after apply)
      + client_public_key              = (known after apply)
      + cloud_metadata                 = (known after apply)
      + detected_properties            = (known after apply)
      + display_name                   = (known after apply)
      + dns_fqdn                       = (known after apply)
      + domain_name                    = (known after apply)
      + id                             = (known after apply)
      + identity                       = (known after apply)
      + last_status_change_time        = (known after apply)
      + location                       = (known after apply)
      + location_data                  = (known after apply)
      + machine_fqdn                   = (known after apply)
      + mssql_discovered               = (known after apply)
      + name                           = "AzSHOST1"
      + os_name                        = (known after apply)
      + os_profile                     = (known after apply)
      + os_sku                         = (known after apply)
      + os_type                        = (known after apply)
      + os_version                     = (known after apply)
      + parent_cluster_resource_id     = (known after apply)
      + private_link_scope_resource_id = (known after apply)
      + resource_group_name            = "iacp1-rg"
      + service_status                 = (known after apply)
      + status                         = (known after apply)
      + tags                           = (known after apply)
      + vm_id                          = (known after apply)
      + vm_uuid                        = (known after apply)
    }

  # module.base.module.hci0.module.serverRoleBindings["AzSHOST1"].azurerm_role_assignment.MachineRoleAssign["ACMRM"] will be created
  + resource "azurerm_role_assignment" "MachineRoleAssign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Connected Machine Resource Manager"
      + scope                            = "/subscriptions/de3c4d5e-af08-451a-a873-438d86ab6f4b/resourceGroups/iacp1-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci0.module.serverRoleBindings["AzSHOST1"].azurerm_role_assignment.MachineRoleAssign["ASHDMR"] will be created
  + resource "azurerm_role_assignment" "MachineRoleAssign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Stack HCI Device Management Role"
      + scope                            = "/subscriptions/de3c4d5e-af08-451a-a873-438d86ab6f4b/resourceGroups/iacp1-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci0.module.serverRoleBindings["AzSHOST1"].azurerm_role_assignment.MachineRoleAssign["KVSU"] will be created
  + resource "azurerm_role_assignment" "MachineRoleAssign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/de3c4d5e-af08-451a-a873-438d86ab6f4b/resourceGroups/iacp1-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci0.module.serverRoleBindings["AzSHOST1"].azurerm_role_assignment.MachineRoleAssign["Reader"] will be created
  + resource "azurerm_role_assignment" "MachineRoleAssign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/de3c4d5e-af08-451a-a873-438d86ab6f4b/resourceGroups/iacp1-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci0.module.serverRoleBindings["AzSHOST2"].data.azurerm_arc_machine.server will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_arc_machine" "server" {
      + active_directory_fqdn          = (known after apply)
      + agent                          = (known after apply)
      + agent_version                  = (known after apply)
      + client_public_key              = (known after apply)
      + cloud_metadata                 = (known after apply)
      + detected_properties            = (known after apply)
      + display_name                   = (known after apply)
      + dns_fqdn                       = (known after apply)
      + domain_name                    = (known after apply)
      + id                             = (known after apply)
      + identity                       = (known after apply)
      + last_status_change_time        = (known after apply)
      + location                       = (known after apply)
      + location_data                  = (known after apply)
      + machine_fqdn                   = (known after apply)
      + mssql_discovered               = (known after apply)
      + name                           = "AzSHOST2"
      + os_name                        = (known after apply)
      + os_profile                     = (known after apply)
      + os_sku                         = (known after apply)
      + os_type                        = (known after apply)
      + os_version                     = (known after apply)
      + parent_cluster_resource_id     = (known after apply)
      + private_link_scope_resource_id = (known after apply)
      + resource_group_name            = "iacp1-rg"
      + service_status                 = (known after apply)
      + status                         = (known after apply)
      + tags                           = (known after apply)
      + vm_id                          = (known after apply)
      + vm_uuid                        = (known after apply)
    }

  # module.base.module.hci0.module.serverRoleBindings["AzSHOST2"].azurerm_role_assignment.MachineRoleAssign["ACMRM"] will be created
  + resource "azurerm_role_assignment" "MachineRoleAssign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Connected Machine Resource Manager"
      + scope                            = "/subscriptions/de3c4d5e-af08-451a-a873-438d86ab6f4b/resourceGroups/iacp1-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci0.module.serverRoleBindings["AzSHOST2"].azurerm_role_assignment.MachineRoleAssign["ASHDMR"] will be created
  + resource "azurerm_role_assignment" "MachineRoleAssign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Stack HCI Device Management Role"
      + scope                            = "/subscriptions/de3c4d5e-af08-451a-a873-438d86ab6f4b/resourceGroups/iacp1-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci0.module.serverRoleBindings["AzSHOST2"].azurerm_role_assignment.MachineRoleAssign["KVSU"] will be created
  + resource "azurerm_role_assignment" "MachineRoleAssign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/de3c4d5e-af08-451a-a873-438d86ab6f4b/resourceGroups/iacp1-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci0.module.serverRoleBindings["AzSHOST2"].azurerm_role_assignment.MachineRoleAssign["Reader"] will be created
  + resource "azurerm_role_assignment" "MachineRoleAssign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/de3c4d5e-af08-451a-a873-438d86ab6f4b/resourceGroups/iacp1-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci0-extensions.module.insights[0].azapi_resource.monitor_agent will be created
  + resource "azapi_resource" "monitor_agent" {
      + body                      = {
          + properties = {
              + extensionParameters = {
                  + autoUpgradeMinorVersion = false
                  + enableAutomaticUpgrade  = true
                  + publisher               = "Microsoft.Azure.Monitor"
                  + settings                = {}
                  + type                    = "AzureMonitorWindowsAgent"
                }
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "AzureMonitorWindowsAgent"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + type                      = "Microsoft.AzureStackHCI/clusters/ArcSettings/Extensions@2023-08-01"
    }

  # module.base.module.hci0-extensions.module.insights[0].azurerm_log_analytics_workspace.workspace will be created
  + resource "azurerm_log_analytics_workspace" "workspace" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus"
      + name                            = "iacp1-workspace"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "iacp1-rg"
      + retention_in_days               = (known after apply)
      + secondary_shared_key            = (sensitive value)
      + sku                             = (known after apply)
      + workspace_id                    = (known after apply)
    }

  # module.base.module.hci0-extensions.module.insights[0].azurerm_monitor_data_collection_endpoint.dce will be created
  + resource "azurerm_monitor_data_collection_endpoint" "dce" {
      + configuration_access_endpoint = (known after apply)
      + id                            = (known after apply)
      + immutable_id                  = (known after apply)
      + location                      = "eastus"
      + logs_ingestion_endpoint       = (known after apply)
      + name                          = "iacp1-dce"
      + public_network_access_enabled = true
      + resource_group_name           = "iacp1-rg"
    }

  # module.base.module.hci0-extensions.module.insights[0].azurerm_monitor_data_collection_rule.dcr will be created
  + resource "azurerm_monitor_data_collection_rule" "dcr" {
      + data_collection_endpoint_id = (known after apply)
      + id                          = (known after apply)
      + immutable_id                = (known after apply)
      + location                    = "eastus"
      + name                        = "AzureStackHCI-iacp1-dcr"
      + resource_group_name         = "iacp1-rg"

      + data_flow {
          + destinations = [
              + "iacp1-workspace",
            ]
          + streams      = [
              + "Microsoft-Perf",
            ]
        }
      + data_flow {
          + destinations = [
              + "2-90d1-e814dab6067e",
            ]
          + streams      = [
              + "Microsoft-Event",
            ]
        }

      + data_sources {
          + performance_counter {
              + counter_specifiers            = [
                  + "\\Memory\\Available Bytes",
                  + "\\Network Interface(*)\\Bytes Total/sec",
                  + "\\Processor(_Total)\\% Processor Time",
                  + "\\RDMA Activity(*)\\RDMA Inbound Bytes/sec",
                  + "\\RDMA Activity(*)\\RDMA Outbound Bytes/sec",
                ]
              + name                          = "perfCounterDataSource"
              + sampling_frequency_in_seconds = 10
              + streams                       = [
                  + "Microsoft-Perf",
                ]
            }
          + windows_event_log {
              + name           = "eventLogsDataSource"
              + streams        = [
                  + "Microsoft-Event",
                ]
              + x_path_queries = [
                  + "Microsoft-Windows-SDDC-Management/Operational!*[System[(EventID=3000 or EventID=3001 or EventID=3002 or EventID=3003 or EventID=3004)]]",
                  + "microsoft-windows-health/operational!*",
                ]
            }
        }

      + destinations {
          + log_analytics {
              + name                  = "iacp1-workspace"
              + workspace_resource_id = (known after apply)
            }
          + log_analytics {
              + name                  = "2-90d1-e814dab6067e"
              + workspace_resource_id = (known after apply)
            }
        }
    }

  # module.base.module.hci0-extensions.module.insights[0].azurerm_monitor_data_collection_rule_association.association["AzSHOST1"] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "association" {
      + data_collection_rule_id = (known after apply)
      + id                      = (known after apply)
      + name                    = (known after apply)
      + target_resource_id      = (known after apply)
    }

  # module.base.module.hci0-extensions.module.insights[0].azurerm_monitor_data_collection_rule_association.association["AzSHOST2"] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "association" {
      + data_collection_rule_id = (known after apply)
      + id                      = (known after apply)
      + name                    = (known after apply)
      + target_resource_id      = (known after apply)
    }

  # module.base.module.hci0-provisioners[0].module.servers["AzSHOST1"].terraform_data.provisioner will be created
  + resource "terraform_data" "provisioner" {
      + id = (known after apply)
    }

  # module.base.module.hci0-provisioners[0].module.servers["AzSHOST1"].terraform_data.replacement will be created
  + resource "terraform_data" "replacement" {
      + id     = (known after apply)
      + input  = "iacp1-rg"
      + output = (known after apply)
    }

  # module.base.module.hci0-provisioners[0].module.servers["AzSHOST2"].terraform_data.provisioner will be created
  + resource "terraform_data" "provisioner" {
      + id = (known after apply)
    }

  # module.base.module.hci0-provisioners[0].module.servers["AzSHOST2"].terraform_data.replacement will be created
  + resource "terraform_data" "replacement" {
      + id     = (known after apply)
      + input  = "iacp1-rg"
      + output = (known after apply)
    }

Plan: 38 to add, 0 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#10297758293`](https://github.com/duzitong/testiac/actions/runs/10297758293) - commit 9e894eaa3c08bd9d4868b1c2e56c569b64f2def2
